handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/src/n32g05x_rcc.c
    /* Store the new value */
    RCC->CFG2 = temp_value;
}


/**
*\*\name    RCC_EnableLsi.
*\*\fun     Enables the Internal Low Speed oscillator (LSI).
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE 
*\*\return  none
**/
void RCC_EnableLsi(FunctionalState Cmd)
{
    if(Cmd == ENABLE)
    {
        /* Set LSIEN bit */
        RCC->LSCTRL |= RCC_LSI_ENABLE;
    }
    else
    {
        /* Reset PLLEN bit */
        RCC->LSCTRL &= (~RCC_LSI_ENABLE);
    }
     
}

/**
*\*\name    RCC_SetLsiCalibValue.
*\*\fun     Adjusts the Internal Low Speed oscillator (LSI) calibration value.
*\*\param   calibration_value(the calibration trimming value):
*\*\        This parameter must be a number between 0 and 0x1F
*\*\return  none
**/
void RCC_SetLsiCalibValue(uint8_t calibration_value)
{
    uint32_t temp_value;

    temp_value = RCC->LSCTRL;
    /* Clear LSITRIM[4:0] bits */
    temp_value &= RCC_LSITRIM_MASK;
    /* Set the LSITRIM[4:0] bits according to LSICalibrationValue value */
    temp_value |= (uint32_t)calibration_value << RCC_LSCTRL_LSITRIM_OFFSET;
    /* Store the new value */
    RCC->LSCTRL = temp_value;
}


/**
*\*\name    RCC_WaitLsiStable.
*\*\fun     Waits for LSI start-up.
*\*\param   none
*\*\return  ErrorStatus:
 *\*\         - SUCCESS    LSI oscillator is stable and ready to use
 *\*\         - ERROR      LSI oscillator not yet ready
**/
ErrorStatus RCC_WaitLsiStable(void)
{
    __IO uint32_t counter_value = 0;
    uint32_t timeout_value;   
    FlagStatus status_value;
	RCC_ClocksType sysclk_value;
    ErrorStatus bitstatus;

	RCC_GetClocksFreqValue(&sysclk_value);
	timeout_value = (LSI_STARTUP_TIMEOUT/((uint32_t)64000000/sysclk_value.SysclkFreq));

    /* Wait till LSI is ready and if Time out is reached exit */
    do
    {
        status_value = RCC_GetFlagStatus(RCC_LSCTRL_FLAG_LSIRDF);
        counter_value++;
    } while ((counter_value != timeout_value) && (status_value == RESET));
    
    if (RCC_GetFlagStatus(RCC_LSCTRL_FLAG_LSIRDF) != RESET)
    {
        bitstatus = SUCCESS;
    }
    else
    {
        bitstatus = ERROR;
    }
    return bitstatus;
}

/**
*\*\name    RCC_ConfigRtcClk.
*\*\fun     Configures the RTC clock (RTCCLK).
*\*\param   rtcclk_source(the RTC clock source):
*\*\         - RCC_RTCCLK_SRC_NONE          No clock selected as RTC clock
*\*\         - RCC_RTCCLK_SRC_LSI           LSI selected as RTC clock
*\*\         - RCC_RTCCLK_SRC_HSE_DIV128    HSE clock divided by 128 selected as RTC clock
*\*\         - RCC_RTCCLK_SRC_HSI_DIV128    HSI clock divided by 128 selected as RTC clock
*\*\return  none
*\*\note    Once the RTC clock is selected it can't be changed unless the Backup domain is reset.
**/
void RCC_ConfigRtcClk(uint32_t rtcclk_source)
{
    uint32_t temp_value;

    temp_value = RCC->LSCTRL;

    /* Clear the RTC clock source */
    temp_value &= RCC_RTCCLK_SRC_MASK;
    /* Select the RTC clock source */
    temp_value |= rtcclk_source;

    RCC->LSCTRL = temp_value;
}

/**
*\*\name    RCC_EnableRtcClk.
*\*\fun     Enables the RTC clock.
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE 
*\*\return  none
*\*\note    This function must be used only after the RTC clock was selected 
*\*\        using the RCC_Config_Rtc_Clock function.
**/
void RCC_EnableRtcClk(FunctionalState Cmd)
{
    if(Cmd == ENABLE)
    {
        RCC->LSCTRL |= RCC_RTC_ENABLE;
    }
    else
    {
        RCC->LSCTRL &= (~RCC_RTC_ENABLE);
    }
}

/**
*\*\name    RCC_EnableRTCReset.
*\*\fun     Reset RTC .
*\*\param   none  
*\*\return  none. 
**/
void RCC_EnableRTCReset(void)
{ 
    RCC->LSCTRL |= (RCC_RTCCLK_RESET);
    RCC->LSCTRL &= (~RCC_RTCCLK_RESET);
}

/**
*\*\name    RCC_EnableLockupReset.
*\*\fun     Reset can be generated when M0 core lock up.
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE   
*\*\return  none. 
**/
void RCC_EnableLockupReset(FunctionalState Cmd)
{ 
   if(Cmd == ENABLE)
   {
       /* Set LKUPRST bit */
       RCC->CTRL |= RCC_LKUPRST_ENABLE;
   }
   else
   {
       /* Reset LKUPRST bit */
       RCC->CTRL &= (~RCC_LKUPRST_ENABLE);
   }
    
}

/**
*\*\name    RCC_EnableRAMParityErrorReset.
*\*\fun     Reset can be generated when RAM parity error.
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE   
*\*\return  none. 
**/
void RCC_EnableRAMParityErrorReset(FunctionalState Cmd)
{ 
   if(Cmd == ENABLE)
   {
       /* Set RAMPERRRST bit */
       RCC->CLKINT |= RCC_RAMPERRRST_ENABLE;
   }
   else
   {
       /* Reset RAMPERRRST bit */
       RCC->CLKINT &= (~RCC_RAMPERRRST_ENABLE);
   }
    
}

/**
*\*\name    RCC_EnableLEDClk.
*\*\fun     LED clock enable.
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE 
*\*\return  none. 
**/
void RCC_EnableLEDClk(FunctionalState Cmd)
{ 
   if(Cmd == ENABLE)
   {
       /* Set LEDCLK bit */
       RCC->CFG3 |= RCC_LEDCLK_ENABLE;
   }
   else
   {
       /* Reset LEDCLK bit */
       RCC->CFG3 &= (~RCC_LEDCLK_ENABLE);
   }   
}

/**
*\*\name    RCC_ConfigLEDClk.
*\*\fun     Configures the LED clock (LEDCLK).
*\*\param   LED_clksrc(LED clock source):
*\*\         - RCC_LEDCLK_SRC_HSI    HSI clock selected 
*\*\         - RCC_LEDCLK_SRC_HSE    HSE clock selected 
*\*\param   LED_prescaler(LED clock prescaler):
*\*\         - RCC_LEDCLK_DISABLE 
*\*\         - RCC_LEDCLK_DIV32
*\*\         - RCC_LEDCLK_DIV40
*\*\         - RCC_LEDCLK_DIV50
*\*\         - RCC_LEDCLK_DIV64
*\*\         - RCC_LEDCLK_DIV80
*\*\         - RCC_LEDCLK_DIV160
*\*\return  none
**/
void RCC_ConfigLEDClk(uint32_t LED_clksrc, uint32_t LED_prescaler)
{
    uint32_t temp_value;

    temp_value = RCC->CFG3;
    /* Clear LEDSEL and LEDPRE[3:0] bits */
    temp_value &= RCC_LEDCLK_SRC_MASK;
    temp_value &= RCC_LEDCLK_DIV_MASK;
    /* Set LEDSEL bits according to LED_clksrc value */
    temp_value |= LED_clksrc;
    /* Set LEDPRE[3:0] bits according to LED_prescaler value */
    temp_value |= LED_prescaler;

    /* Store the new value */
    RCC->CFG3 = temp_value;
}

/**
*\*\name    RCC_EnableLEDDMARequest.
*\*\fun     LED DMA Request enable.
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE  
*\*\return  none. 
**/
void RCC_EnableLEDDMARequest(FunctionalState Cmd)
{ 
   if(Cmd == ENABLE)
   {
       /* Set DMAREQ bit */
       RCC->CFG3 |= RCC_LED_DMAREQ_ENABLE;
   }
   else
   {
       /* Reset DMAREQ bit */
       RCC->CFG3 &= (~RCC_LED_DMAREQ_ENABLE);
   }
}

/**
*\*\name    RCC_SetLEDLowLevelCycles.
*\*\fun     Number of low level cycles in one time period.
*\*\param   cycles_value:
*\*\        This parameter must be a number between 2 and 0xFF
*\*\return  none
**/ 
void RCC_SetLEDLowLevelCycles(uint8_t cycles_value) 
{
    uint32_t temp_value;

