handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/src/n32g05x_rcc.c
    temp_value = RCC->CFG3;
    /* Clear GCLKMNUM[7:0] bits */
    temp_value &= RCC_GCLKMNUM_MASK;
    if(cycles_value < RCC_MIN_GCLKMNUM )
    {
        cycles_value = RCC_MIN_GCLKMNUM;
    }
    /* Set the GCLKMNUM[7:0] bits */
    temp_value |= ((uint32_t)cycles_value << RCC_CFG3_GCLKMNUM_OFFSET); 
    /* Store the new value */
    RCC->CFG3 = temp_value;
}

/**
*\*\name    RCC_SetLEDClockCycles.
*\*\fun     Number of clock cycles in one time period.
*\*\param   cycles_value:
*\*\        This parameter must be fiexed at 130.
*\*\return  none
**/ 
void RCC_SetLEDClockCycles(uint8_t cycles_value) 
{
    uint32_t temp_value;

    temp_value = RCC->CFG3;
    /* Clear GCLKNNUM[7:0] bits */
    temp_value &= RCC_GCLKNNUM_MASK;
    /* Set the GCLKNNUM[7:0] bits */
    temp_value |= ((uint32_t)cycles_value << RCC_CFG3_GCLKNNUM_OFFSET); 
    /* Store the new value */
    RCC->CFG3 = temp_value;
}

/**
*\*\name    RCC_ConfigALL_LED_GCLK.
*\*\fun     Configures GCLKEN GCLKSEL GCLKDMAEN GCLKPRE[3:0] GCLKMNUM[7:0] GCLKNNUM[7:0].
*\*\param   Gclk_Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE 
*\*\param   LED_clksrc(LED clock source):
*\*\         - RCC_LEDCLK_SRC_HSI    HSI clock selected 
*\*\         - RCC_LEDCLK_SRC_HSE    HSE clock selected 
*\*\param   LED_prescaler(LED clock prescaler):
*\*\         - RCC_LEDCLK_DISABLE 
*\*\         - RCC_LEDCLK_DIV32
*\*\         - RCC_LEDCLK_DIV40
*\*\         - RCC_LEDCLK_DIV50
*\*\         - RCC_LEDCLK_DIV64
*\*\         - RCC_LEDCLK_DIV80
*\*\         - RCC_LEDCLK_DIV160
*\*\param   GclkDma_Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE 
*\*\param   mcycles_value:
*\*\        This parameter must be a number between 1 and 0xFF
*\*\param   ncycles_value:
*\*\        This parameter must be a number between 1 and 0xFF
*\*\return  none
**/ 
void RCC_ConfigALL_LED_GCLK(FunctionalState Gclk_Cmd, uint32_t LED_clksrc, uint32_t LED_prescaler, \
                            FunctionalState GclkDma_Cmd, uint8_t mcycles_value, uint8_t ncycles_value)
{
    uint32_t temp_value;

    temp_value = RCC->CFG3;

    /* Clear LEDSEL and LEDPRE[3:0] bits */
    temp_value &= RCC_LEDCLK_SRC_MASK;
    temp_value &= RCC_LEDCLK_DIV_MASK;
    /* Clear GCLKMNUM[7:0] bits */
    temp_value &= RCC_GCLKMNUM_MASK;
    /* Clear GCLKNNUM[7:0] bits */
    temp_value &= RCC_GCLKNNUM_MASK;

    /* Set GCLKEN value */
    if(Gclk_Cmd == ENABLE)
    {
        /* Set LEDCLK bit */
        temp_value |= RCC_LEDCLK_ENABLE;
    }
    else
    {
        /* Reset LEDCLK bit */
        temp_value &= (~RCC_LEDCLK_ENABLE);
    }

    /* Set LEDSEL bits according to LED_clksrc value */
    temp_value |= LED_clksrc;
    /* Set LEDPRE[3:0] bits according to LED_prescaler value */
    temp_value |= LED_prescaler;

    /* Set GCLKDMAEN value */
    if(GclkDma_Cmd == ENABLE)
    {
        /* Set DMAREQ bit */
        temp_value |= RCC_LED_DMAREQ_ENABLE;
    }
    else
    {
        /* Reset DMAREQ bit */
        temp_value &= (~RCC_LED_DMAREQ_ENABLE);
    }

    /* GCLKMNUM[7:0] value >= 1 */
    if(mcycles_value < RCC_MIN_GCLKMNUM )
    {
        mcycles_value = RCC_MIN_GCLKMNUM;
    }
    /* Set the GCLKMNUM[7:0] bits */
    temp_value |= ((uint32_t)mcycles_value << RCC_CFG3_GCLKMNUM_OFFSET); 

    /* GCLKNNUM[7:0] value >= 1 */
    if(ncycles_value < RCC_MIN_GCLKNNUM )
    {
        ncycles_value = RCC_MIN_GCLKNNUM;
    }
    /* Set the GCLKNNUM[7:0] bits */
    temp_value |= ((uint32_t)ncycles_value << RCC_CFG3_GCLKNNUM_OFFSET); 

    /* Store the new value */
    RCC->CFG3 = temp_value;
}


/**
*\*\name    RCC_GetClocksFreqValue.
*\*\fun     Returns the frequencies of different on chip clocks.
*\*\param   RCC_clocks pointer to a RCC_ClocksType structure which will hold
*\*\        the clocks frequencies.
*\*\return  none
*\*\note    The result of this function could be not correct when using
*\*\        fractional value for HSE crystal.  
**/
void RCC_GetClocksFreqValue(RCC_ClocksType* RCC_clocks)
{
    uint32_t temp, pllclk, pllmull, pllpre, plloutdiv, pllsource, presc;
    const uint8_t ApbAhbPresTable[16]     = {0, 0, 0, 0, 1, 2, 3, 4, 1, 2, 3, 4, 6, 7, 8, 9};
    const uint8_t AdcHclkPresTable[16]    = {1, 2, 4, 6, 8, 10, 12, 16, 32, 32, 32, 32, 32, 32, 32, 32};
    const uint16_t AdcPllClkPresTable[16] = {1, 2, 4, 6, 8, 10, 12, 16, 32, 64, 128, 256, 256, 256, 256, 256};
    
    /* Get PLL clock source, PLL Pre-Divider, PLL out div and multiplication factor ----------------------*/
    pllmull   = RCC->CFG & RCC_CFG_PLLMULFCT;
    pllpre    = RCC->CFG & RCC_CFG_PLLPRE;
    plloutdiv = RCC->CFG & RCC_CFG_PLLOUTDIV;
    pllsource = RCC->CFG & RCC_CFG_PLLSRC;

    pllmull = (pllmull >> 16) + 3;

    if ((pllsource >> 24) == 0x00)
    { 
        /* HSI selected as PLL clock entry */
        pllclk = HSI_VALUE * pllmull;
    }
    else
    {
        /* HSE selected as PLL clock entry */
        pllclk = HSE_VALUE * pllmull;
    }
    
    /* PLL Pre-Divider clock */
    pllpre = (pllpre >> 20) + 1;
    pllclk = pllclk / pllpre;

    /* PLL Out Div clock */
    plloutdiv = (plloutdiv >> 22) + 1;
    pllclk = pllclk / plloutdiv;

    /* Get SYSCLK source -------------------------------------------------------*/
    temp = RCC->CFG & RCC_CFG_SCLKSTS;

    switch (temp)
    {
        case RCC_CFG_SCLKSTS_HSI: /* HSI used as system clock */
            RCC_clocks->SysclkFreq = HSI_VALUE;
            break;
        case RCC_CFG_SCLKSTS_HSE: /* HSE used as system clock */
            RCC_clocks->SysclkFreq = HSE_VALUE;
            break;
        case RCC_CFG_SCLKSTS_PLL: /* PLL used as system clock */
            RCC_clocks->SysclkFreq = pllclk;
            break;
        case RCC_CFG_SCLKSTS_LSI: /* LSI used as system clock */
            RCC_clocks->SysclkFreq = LSI_VALUE;
            break;

        default:
            RCC_clocks->SysclkFreq = HSI_VALUE;
            break;
    }

    /* Compute HCLK, PCLK1, PCLK2 and ADCCLK clocks frequencies ----------------*/
    /* Get HCLK prescaler */
    temp   = RCC->CFG & RCC_CFG_AHBPRES;
    temp   = temp >> 4;
    if(temp < 0x8)
    {
        temp = 0;
    }
    presc = ApbAhbPresTable[temp];
    /* HCLK clock frequency */
    RCC_clocks->HclkFreq = RCC_clocks->SysclkFreq >> presc;
    /* Get PCLK1 prescaler */
    temp   = RCC->CFG & RCC_CFG_APB1PRES;
    temp   = temp >> 8;
    presc = ApbAhbPresTable[temp];
    /* PCLK1 clock frequency */
    RCC_clocks->Pclk1Freq = RCC_clocks->HclkFreq >> presc;
    /* Get PCLK2 prescaler */
    temp   = RCC->CFG & RCC_CFG_APB2PRES;
    temp   = temp >> 11;
    presc = ApbAhbPresTable[temp];
    /* PCLK2 clock frequency */
    RCC_clocks->Pclk2Freq = RCC_clocks->HclkFreq >> presc;

