handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/src/n32g05x_rcc.c
    /* Get ADCHCLK prescaler */
    temp   = RCC->CFG2 & RCC_CFG2_ADCHPRES;
    presc = AdcHclkPresTable[temp];
    /* ADCHCLK clock frequency */
    RCC_clocks->AdcHclkFreq = RCC_clocks->HclkFreq / presc;
    /* Get ADCPLLCLK prescaler */
    temp   = RCC->CFG2 & RCC_CFG2_ADCPLLPRES;
    temp   = temp >> 4;
    presc = AdcPllClkPresTable[(temp & (uint32_t)0xF)]; // ignore BIT5
    /* ADCPLLCLK clock frequency */
    RCC_clocks->AdcPllClkFreq = pllclk / presc;
}

/**
*\*\name    RCC_EnableAHBPeriphClk.
*\*\fun     Enables the AHB peripheral clock.
*\*\param   AHB_periph (AHB peripheral to gates its clock):
*\*\        - RCC_AHB_PERIPH_DMA  
*\*\        - RCC_AHB_PERIPH_SRAM 
*\*\        - RCC_AHB_PERIPH_FLITF
*\*\        - RCC_AHB_PERIPH_CRC  
*\*\        - RCC_AHB_PERIPH_SAC  
*\*\        - RCC_AHB_PERIPH_ADC
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE    
*\*\return  none
**/
void RCC_EnableAHBPeriphClk(uint32_t AHB_periph, FunctionalState Cmd)
{
    if (Cmd != DISABLE)
    {
        RCC->AHBPCLKEN |= AHB_periph;
    }
    else
    {
        RCC->AHBPCLKEN &= ~AHB_periph;
    }
    
}

/**
*\*\name    RCC_EnableAPB2PeriphClk.
*\*\fun     Enables the High Speed APB (APB2) peripheral clock.
*\*\param   APB2_periph (APB2 peripheral to gates its clock):
*\*\        - RCC_APB2_PERIPH_AFIO 
*\*\        - RCC_APB2_PERIPH_GPIOA 
*\*\        - RCC_APB2_PERIPH_GPIOB 
*\*\        - RCC_APB2_PERIPH_GPIOC 
*\*\        - RCC_APB2_PERIPH_GPIOD 
*\*\        - RCC_APB2_PERIPH_SPI1 
*\*\        - RCC_APB2_PERIPH_SPI2 
*\*\        - RCC_APB2_PERIPH_SPI3 
*\*\        - RCC_APB2_PERIPH_TIM1 
*\*\        - RCC_APB2_PERIPH_TIM2 
*\*\        - RCC_APB2_PERIPH_UART1
*\*\        - RCC_APB2_PERIPH_UART2
*\*\        - RCC_APB2_PERIPH_TIM3 
*\*\        - RCC_APB2_PERIPH_TIM4 
*\*\        - RCC_APB2_PERIPH_TIM5 
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE 
*\*\return none. 
**/
void RCC_EnableAPB2PeriphClk(uint32_t APB2_periph, FunctionalState Cmd)
{
    if (Cmd != DISABLE)
    {
        RCC->APB2PCLKEN |= APB2_periph;
    }
    else
    {
        RCC->APB2PCLKEN &= ~APB2_periph;
    }
    
}


/**
*\*\name    RCC_EnableAPB1PeriphClk.
*\*\fun     Enables the High Speed APB (APB1) peripheral clock.
*\*\param   APB1_periph (APB1 peripheral to gates its clock):
*\*\        - RCC_APB1_PERIPH_TIM6    
*\*\        - RCC_APB1_PERIPH_BEEP    
*\*\        - RCC_APB1_PERIPH_COMP    
*\*\        - RCC_APB1_PERIPH_COMPFILT
*\*\        - RCC_APB1_PERIPH_LCD     
*\*\        - RCC_APB1_PERIPH_WWDG   
*\*\        - RCC_APB1_PERIPH_UART3   
*\*\        - RCC_APB1_PERIPH_UART4   
*\*\        - RCC_APB1_PERIPH_UART5   
*\*\        - RCC_APB1_PERIPH_I2C1    
*\*\        - RCC_APB1_PERIPH_I2C2    
*\*\        - RCC_APB1_PERIPH_CAN     
*\*\        - RCC_APB1_PERIPH_DAC     
*\*\        - RCC_APB1_PERIPH_PWR  
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE       
*\*\return none. 
**/
void RCC_EnableAPB1PeriphClk(uint32_t APB1_periph, FunctionalState Cmd)
{
    if (Cmd != DISABLE)
    {
        RCC->APB1PCLKEN |= APB1_periph;
    }
    else
    {
        RCC->APB1PCLKEN &= ~APB1_periph;
    }
    
}

/**
*\*\name    RCC_EnableAHBPeriphReset.
*\*\fun     AHB peripheral reset.
*\*\param   AHB_periph specifies the AHB peripheral to reset.    
*\*\        - RCC_AHB_PERIPH_SAC  
*\*\        - RCC_AHB_PERIPH_ADC 
*\*\return none.
**/
void RCC_EnableAHBPeriphReset(uint32_t AHB_periph)
{
    RCC->AHBPRST |= AHB_periph;
    RCC->AHBPRST &= ~AHB_periph;
}

/**
*\*\name    RCC_EnableAPB2PeriphReset.
*\*\fun     High Speed APB (APB2) peripheral reset.
*\*\param   APB2_periph specifies the APB2 peripheral to reset.
*\*\        - RCC_APB2_PERIPH_AFIO 
*\*\        - RCC_APB2_PERIPH_GPIOA 
*\*\        - RCC_APB2_PERIPH_GPIOB 
*\*\        - RCC_APB2_PERIPH_GPIOC 
*\*\        - RCC_APB2_PERIPH_GPIOD 
*\*\        - RCC_APB2_PERIPH_SPI1 
*\*\        - RCC_APB2_PERIPH_SPI2 
*\*\        - RCC_APB2_PERIPH_SPI3 
*\*\        - RCC_APB2_PERIPH_TIM1 
*\*\        - RCC_APB2_PERIPH_TIM2 
*\*\        - RCC_APB2_PERIPH_UART1
*\*\        - RCC_APB2_PERIPH_UART2
*\*\        - RCC_APB2_PERIPH_TIM3 
*\*\        - RCC_APB2_PERIPH_TIM4 
*\*\        - RCC_APB2_PERIPH_TIM5   
*\*\return none.
**/
void RCC_EnableAPB2PeriphReset(uint32_t APB2_periph)
{
    RCC->APB2PRST |= APB2_periph;
    RCC->APB2PRST &= ~APB2_periph;
}

/**
*\*\name    RCC_EnableAPB1PeriphReset.
*\*\fun     Low Speed APB (APB1) peripheral reset.
*\*\param   APB1_periph specifies the APB1 peripheral to reset.
*\*\        - RCC_APB1_PERIPH_TIM6    
*\*\        - RCC_APB1_PERIPH_BEEP    
*\*\        - RCC_APB1_PERIPH_COMP 
*\*\        - RCC_APB1_PERIPH_LCD     
*\*\        - RCC_APB1_PERIPH_WWDG   
*\*\        - RCC_APB1_PERIPH_UART3   
*\*\        - RCC_APB1_PERIPH_UART4   
*\*\        - RCC_APB1_PERIPH_UART5   
*\*\        - RCC_APB1_PERIPH_I2C1    
*\*\        - RCC_APB1_PERIPH_I2C2    
*\*\        - RCC_APB1_PERIPH_CAN     
*\*\        - RCC_APB1_PERIPH_DAC     
*\*\        - RCC_APB1_PERIPH_PWR       
*\*\return none. 
**/
void RCC_EnableAPB1PeriphReset(uint32_t APB1_periph)
{
    RCC->APB1PRST |= APB1_periph;
    RCC->APB1PRST &= ~APB1_periph;
}

/**
*\*\name   RCC_ConfigMcoClkPre.
*\*\fun    Configures the MCO PLL clock prescaler.
*\*\param  MCO_PLL_prescaler(MCO PLL clock prescaler): 
*\*\        - RCC_MCO_PLLCLK_DIV2 
*\*\        - RCC_MCO_PLLCLK_DIV3 
*\*\        - RCC_MCO_PLLCLK_DIV4 
*\*\        - RCC_MCO_PLLCLK_DIV5 
*\*\        - RCC_MCO_PLLCLK_DIV6 
*\*\        - RCC_MCO_PLLCLK_DIV7 
*\*\        - RCC_MCO_PLLCLK_DIV8 
*\*\        - RCC_MCO_PLLCLK_DIV9 
*\*\        - RCC_MCO_PLLCLK_DIV10
*\*\        - RCC_MCO_PLLCLK_DIV11
*\*\        - RCC_MCO_PLLCLK_DIV12
*\*\        - RCC_MCO_PLLCLK_DIV13
*\*\        - RCC_MCO_PLLCLK_DIV14
*\*\        - RCC_MCO_PLLCLK_DIV15 
*\*\return  none. 
**/
void RCC_ConfigMcoClkPre(uint32_t MCO_PLL_prescaler)
{
    uint32_t temp_value;

    temp_value = RCC->CFG;
    /* Clear MCOPRE[3:0] bits */
    temp_value &= RCC_MCO_PLLCLK_DIV_MASK;
    /* Set MCOPRE[3:0] bits according to MCO_PLL_prescaler value */
    temp_value |= MCO_PLL_prescaler;

