handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/src/n32g05x_rcc.c
    /* Store the new value */
    RCC->CFG = temp_value;
}

/**
*\*\name   RCC_ConfigMco.
*\*\fun    Selects the clock source to output on MCO pin.
*\*\param  MCO_source(clock source to output): 
*\*\     - RCC_MCO_NOCLK      
*\*\     - RCC_MCO_SYSCLK     
*\*\     - RCC_MCO_HSI        
*\*\     - RCC_MCO_HSE       
*\*\     - RCC_MCO_PLLCLK_PRES     
*\*\     - RCC_MCO_LSI    
*\*\return  none. 
**/
void RCC_ConfigMco(uint32_t MCO_source)
{
    uint32_t temp_value;

    temp_value = RCC->CFG;
    /* Clear MCO[2:0] bits */
    temp_value &= RCC_MCO_MASK;
    /* Set MCO[2:0] bits according to MCO_source value */
    temp_value |= MCO_source;

    /* Store the new value */
    RCC->CFG = temp_value;
}

/**
*\*\name    RCC_GetFlagStatus.
*\*\fun     Checks whether the specified RCC flag is set or not.
*\*\param   RCC_flag:
*\*\	      - RCC_CTRL_FLAG_HSIRDF           HSI oscillator clock ready
*\*\	      - RCC_CTRL_FLAG_HSI24MRDF        HSI oscillator clock ready
*\*\          - RCC_CTRL_FLAG_HSERDF           HSE oscillator clock ready
*\*\	      - RCC_CTRL_FLAG_PLLRDF           PLL clock ready
*\*\	      - RCC_LSCTRL_FLAG_LSIRDF         LSI oscillator clock ready
*\*\	      - RCC_CTRLSTS_FLAG_RAMPERRRSTF   RAM parity error reset
*\*\	      - RCC_CTRLSTS_FLAG_MMURSTF       Mmu reset flag
*\*\	      - RCC_CTRLSTS_FLAG_PINRSTF       Pin reset
*\*\	      - RCC_CTRLSTS_FLAG_PORRSTF       POR/PDR reset
*\*\	      - RCC_CTRLSTS_FLAG_SFTRSTF       Software reset
*\*\	      - RCC_CTRLSTS_FLAG_IWDGRSTF      Independent Watchdog reset
*\*\	      - RCC_CTRLSTS_FLAG_WWDGRSTF      Window Watchdog reset
*\*\	      - RCC_CTRLSTS_FLAG_LPWRRSTF      Low Power reset
*\*\	      - RCC_CTRLSTS_FLAG_EMCGBNRSTF    EMCGBN reset
*\*\	      - RCC_CTRLSTS_FLAG_EMCGBRSTF     EMCGB reset
*\*\	      - RCC_CTRLSTS_FLAG_LKUPRSTF      M0 lock up reset
*\*\	      - RCC_CTRLSTS_FLAG_LVRRSTF       LVR reset
*\*\	      - RCC_CFG3_FLAG_LEDCLKDONEF      LED GCLK output Output the full number
*\*\return  FlagStatus:    
*\*\      	  - SET 
*\*\  	      - RESET
**/
FlagStatus RCC_GetFlagStatus(uint8_t RCC_flag)
{
    uint32_t temp_value;
    uint32_t reg_value;
    FlagStatus bitstatus;

    /* Get the RCC register index */
    temp_value = (uint32_t)RCC_flag >> RCC_FLAG_OFFSET;
    switch(temp_value)
    {
        case 1: /* The flag to check is in CTRL register */
            reg_value = RCC->CTRL;
            break;
        case 2: /* The flag to check is in LSCTRL register */
           reg_value = RCC->LSCTRL;
           break;
        case 3:/* The flag to check is in CTRLSTS register */
            reg_value = RCC->CTRLSTS;
            break;
        default:/* The flag to check is in CFG3 register */
            reg_value = RCC->CFG3;
            break;
    }

    /* Get the flag position */
    temp_value = (uint32_t)RCC_flag & RCC_FLAG_MASK;
    if ((reg_value & ((uint32_t)1 << temp_value)) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
*\*\name    RCC_ClearResetFlag.
*\*\fun     Clears the RCC reset flags.
*\*\param   none
*\*\return  none
*\*\note  Clear the following flags:
*\*\	      - RCC_CTRLSTS_FLAG_RAMPERRRSTF   RAM parity error reset
*\*\	      - RCC_CTRLSTS_FLAG_MMURSTF       Mmu reset flag
*\*\	      - RCC_CTRLSTS_FLAG_PINRSTF       Pin reset
*\*\	      - RCC_CTRLSTS_FLAG_PORRSTF       POR/PDR reset
*\*\	      - RCC_CTRLSTS_FLAG_SFTRSTF       Software reset
*\*\	      - RCC_CTRLSTS_FLAG_IWDGRSTF      Independent Watchdog reset
*\*\	      - RCC_CTRLSTS_FLAG_WWDGRSTF      Window Watchdog reset
*\*\	      - RCC_CTRLSTS_FLAG_LPWRRSTF      Low Power reset
*\*\	      - RCC_CTRLSTS_FLAG_EMCGBNRSTF    EMCGBN reset
*\*\	      - RCC_CTRLSTS_FLAG_EMCGBRSTF     EMCGB reset
*\*\	      - RCC_CTRLSTS_FLAG_LKUPRSTF      M0 lock up reset
*\*\	      - RCC_CTRLSTS_FLAG_LVRRSTF       LVR reset
**/
void RCC_ClearResetFlag(void)
{
    /* Set RMRSTF bit to clear the reset flags */
    RCC->CTRLSTS |= RCC_REMOVE_RESET_FLAG;
    /* RMRSTF bit should be reset */
    RCC->CTRLSTS &= ~RCC_REMOVE_RESET_FLAG;
}

/**
*\*\name    RCC_GetIntStatus.
*\*\fun     Checks whether the specified RCC interrupt has occurred or not.
*\*\param   interrupt_flag(RCC interrupt source to check):
*\*\         - RCC_INT_LSIRDIF    LSI ready interrupt
*\*\         - RCC_INT_HSIRDIF    HSI ready interrupt
*\*\         - RCC_INT_HSERDIF    HSE ready interrupt
*\*\         - RCC_INT_PLLRDIF    PLL ready interrupt
*\*\         - RCC_INT_RAMPERRIF  RAM Parity Error Interrupt 
*\*\         - RCC_INT_CLKSSIF    Clock Security System interrupt in HSE
*\*\return  The new state of RccInt 
*\*\         - SET
*\*\         - RESET
**/
INTStatus RCC_GetIntStatus(uint32_t interrupt_flag)
{
    INTStatus bitstatus;
    /* Check the status of the specified RCC interrupt */
    if ((RCC->CLKINT & interrupt_flag) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
*\*\name    RCC_ClrIntPendingBit.
*\*\fun     Clears the RCC's interrupt pending bits.
*\*\param   interrupt_clear(interrupt pending bit to clear):
*\*\         - RCC_CLR_LSIRDIF    LSI ready interrupt
*\*\         - RCC_CLR_HSIRDIF    HSI ready interrupt
*\*\         - RCC_CLR_HSERDIF    HSE ready interrupt
*\*\         - RCC_CLR_PLLRDIF    PLL ready interrupt
*\*\         - RCC_CLR_RAMPERRIF  RAM Parity Error Interrupt 
*\*\         - RCC_CLR_CLKSSIF    Clock Security System interrupt in HSE
*\*\return  none
**/
void RCC_ClrIntPendingBit(uint32_t interrupt_clear)
{
    /* Software set this bit to clear INT flag. */
    RCC->CLKINT |= interrupt_clear;
}

/**
*\*\name    RCC_EnableEMCReset.
*\*\fun     Configure whether to generate a reset request when an EMC error occurs.
*\*\param   EMC_type:
*\*\          - GB3
*\*\          - GB2
*\*\          - GB1
*\*\          - GB0
*\*\          - GBN3
*\*\          - GBN2
*\*\          - GBN1
*\*\          - GBN0
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE   
*\*\return  none. 
**/
void RCC_EnableEMCReset(uint32_t EMC_type, FunctionalState Cmd)
{ 
   if (Cmd != DISABLE)
    {
        RCC->EMCCTRL |= (EMC_type<<12);
    }
    else
    {
        RCC->EMCCTRL &= (~(EMC_type<<12));
    }   
}

/**
*\*\name    RCC_EnableEMCDetect.
*\*\fun     Configure whether to enable EMC detection.
*\*\param   EMC_type:
*\*\          - GB3
*\*\          - GB2
*\*\          - GB1
*\*\          - GB0
*\*\          - GBN3
*\*\          - GBN2
*\*\          - GBN1
*\*\          - GBN0
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE   
*\*\return  none. 
**/
void RCC_EnableEMCDetect(uint32_t EMC_type, FunctionalState Cmd)
{ 
   if (Cmd != DISABLE)
    {
        RCC->EMCCTRL |= EMC_type;
    }
    else
    {
        RCC->EMCCTRL &= ~EMC_type;
    }   
}

